Revit 2024 API
DirectShape.HasExternallyTaggedReference Method
 Checks if the externally tagged reference is already present in this DirectShape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public bool HasExternallyTaggedReference(
	ExternalGeometryId externalId
)
Visual Basic
Public Function HasExternallyTaggedReference ( _
	externalId As ExternalGeometryId _
) As Boolean
Visual C++
public:
bool HasExternallyTaggedReference(
	ExternalGeometryId^ externalId
)
Parameters
externalId
Type: Autodesk.Revit.DB.ExternalGeometryId
 The external ID of the tagged reference to check for.
Return Value
 True if the DirectShape holds a reference with the specified ExternalGeometryId.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DirectShape Class
Autodesk.Revit.DB Namespace